[
  {
    "company": "Longshot Systems",
    "endingDate": "Now",
    "jobTitle": "senior full stack developer",
    "location": "London",
    "roles": ["Stay tuned for more..."],
    "startingDate": "Nov 2018",
    "technologies": ["Golang"],
    "url": "https://www.longshotsystems.co.uk/"
  },
  {
    "company": "Trussle",
    "endingDate": "Oct 2018",
    "jobTitle": "senior full stack developer",
    "location": "London",
    "roles": [
      "Conceptualized and implemented the first version of Typescript fraud-checker bot, on top of Node.js. The bot used data heuristics to compare new applications against, previously flagged, fraudulent ones and would automatically notify internal compliance, if required.",
      "Implemented both the client side (React) and server side (Typescript) of an internal tool, used by Customer Success personnel, that replaced a non GDPR compliant workflow. The tool allowed bigger visibility, particularly in terms of data, into a critical part of the mortgage submission workflow.",
      "Worked on mortgage application automation, by implementing a server-side Typescript budget planner. The latter used statistical data to assess user’s affordability to mortgage products."
    ],
    "startingDate": "Apr 2018",
    "technologies": [
      "React",
      "SASS",
      "Typescript",
      "PostgreSQL",
      "Node.js",
      "Webpack"
    ],
    "url": "https://trussle.com/"
  },
  {
    "company": "Hyperglance",
    "endingDate": "Mar 2018",
    "jobTitle": "senior full stack developer",
    "location": "London",
    "roles": [
      "Kick-started and lead conceptualization and development of Hyperglance’s Web Client. This included selecting what technologies to use, defining a CI build, developing the Client’s architectural backbone, implementing a scalable SASS rule-structure, and outlining coding practices and standards. Moreover, oversaw all technical aspects regarding the Web Client and its integration with the Hyperglance server.",
      "Enhanced the Hyperglance JEE server-side feature-base, by developing core modules. The latter spanned the full server-side architectural stack, ranging from JAX-RS Rest Endpoints, and EJB enhanced business-logic features, to JPA persistence components. Additionally, implemented several real-time data gathering integrations between Hyperglance and external datasources (e.g., AWS, Openstack). This involved normalizing external data into Hyperglance’s topological and analytical data model.",
      "Other responsibilities included: interviewing both frontend and backend developer candidates, attending conferences, interacting with customers, mentoring new-hires."
    ],
    "startingDate": "Jul 2014",
    "technologies": [
      "AngularJs",
      "Javascript",
      "SASS",
      "Three.js",
      "Java EE",
      "EJBs",
      "PostgreSQL",
      "Webpack",
      "Gradle",
      "Wildfly"
    ],
    "url": "https://www.hyperglance.com/"
  },
  {
    "company": "Guidewire Software",
    "endingDate": "Jun 2014",
    "jobTitle": "solutions consultant",
    "location": "Dublin",
    "roles": [
      "Partly designed, developed and maintained an efficient and fault-tolerant configuration of a multi-tiered J2EE Guidewire billing product on two tier one Insurance companies, that would later handle several millions of Dollars and GBPs of insurance premium.",
      "Designed and developed integration points (e.g., SOAP, JMS) between the client server application and external third party services, that provided scalable and concurrent bidirectional data flows based on real-time monetary client transactions.",
      "Conceptualized and implemented a modular JUnit framework for populating Guidewire’s product database with test data. The framework improved the JUnit development productivity, on average, by 50%."
    ],
    "startingDate": "Nov 2012",
    "technologies": ["Java", "JMS", "SOAP", "Rest", "PostgreSQL"],
    "url": "https://www.guidewire.com/"
  }
]
